shengjiang-yaya11/sun-growth/esp32_firmware/sdkconfig.defaults
# ============================================================
#  【ESP32 端固件】烧录目标: ESP32-S3 CAM V1.1 开发板
#  编译工具链: ESP-IDF v5.x + Xtensa gcc (不依赖电脑端软件)
#  烧录方式: USB 连接开发板, 运行 idf.py flash
# ============================================================
#
# ESP32-S3 生物成长记录仪 - SDK 配置
# v2.2 修复版: DIO Flash + Quad PSRAM + FULL PHY校准
#
# 纯 ESP-IDF 项目, 无 Rust 依赖 (ADR-001)
# SoftAP Captive Portal 配网 (ADR-003)

# ============================================================
# 目标芯片
# ============================================================
CONFIG_IDF_TARGET="esp32s3"

# ============================================================
# Flash & PSRAM
# 硬件: ESP32-S3-WROOM-1, 16MB Flash (Zbit ZB25VQ128, devID 4017h)
# v2.2 修复: DIO Flash模式 (硬件确认为DIO, 非QIO)
# PSRAM: Quad模式 (Octal模式导致WiFi AP无法启动, commit 4680c9d)
# ============================================================
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ============================================================
# WiFi PHY 射频校准 (v2.2 关键修复)
# 工厂复位 nvs_flash_erase() 会清除 NVS 中的校准数据
# PARTIAL 校准不足以恢复射频, 必须使用 FULL 校准
# TX功率 20dBm (80 = 20dBm, 不使用84=21dBm以免不稳定)
# ============================================================
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION=y
CONFIG_ESP_PHY_RF_CAL_FULL=y
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=80
CONFIG_ESP_PHY_MAX_TX_POWER=80

# ============================================================
# 分区表 (大 app, 无 OTA)
# ============================================================
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ============================================================
# FreeRTOS
# ============================================================
CONFIG_FREERTOS_HZ=1000
# 主任务栈大小: 默认 3584 字节不足以支撑 mbedTLS 加密 + HTTP 上传 + JSON 解析
# 提升至 8192 字节 (8KB), 避免栈溢出导致看门狗复位
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ============================================================
# 看门狗 (Watchdog)
# HTTP 上传 + AES 加密可能超过默认 5s 超时, 延长至 30s
# ============================================================
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# ============================================================
# 摄像头组件
# ============================================================
CONFIG_CAMERA_OV3660=y

# ============================================================
# WiFi (STA + AP 模式, 用于配网)
# ============================================================
CONFIG_ESP_WIFI_STA_RECONNECT=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# ============================================================
# HTTP 服务器 (配网 Captive Portal)
# ============================================================
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# ============================================================
# mbedTLS 加密支持 (安全模块: AES-256-CTR + HMAC-SHA256 + SHA-256)
# ============================================================
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_CIPHER_MODE_CTR=y
CONFIG_MBEDTLS_SHA256_C=y
CONFIG_MBEDTLS_MD_C=y

# ============================================================
# NVS 加密 (保护设备密钥等敏感配置)
# 生产环境启用, 开发时保持禁用以简化调试
# 启用前需配置 Flash 加密 + nvs_keys 分区
# ============================================================
# CONFIG_NVS_ENCRYPTION=y
# CONFIG_NVS_ENCRYPTION_KEYS_FLASH=y

# ============================================================
# Flash 加密与安全启动 (生产环境)
# 首次开发时保持禁用, 量产时启用
# ============================================================
# CONFIG_SECURE_BOOT=y
# CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
# CONFIG_SECURE_FLASH_ENC_ENABLED=y